USE `Издательство`;

INSERT INTO Книги (ID, ISBN, Название, Страницы, Дата_публикации)
VALUES
(1, 1234567890, 'Книга 1', 200, '2023-01-01'),
(2, 2345678901, 'Книга 2', 150, '2023-02-15'),
(3, 3456789012, 'Книга 3', 300, '2023-03-10'),
(4, 4567890123, 'Книга 4', 250, '2023-04-20'),
(5, 5678901234, 'Книга 5', 180, '2023-05-05');

INSERT INTO Авторы (ID, Имя, Фамилия)
VALUES
(1, 'Иван', 'Иванов'),
(2, 'Пётр', 'Петров'),
(3, 'Джон', 'Сноу');

INSERT INTO Жанры (ID, Название)
VALUES
(1, 'Фантастика'),
(2, 'Детектив'),
(3, 'Русская литература');

INSERT INTO Книги_Авторы (Книга_ID, Автор_ID)
VALUES
(1, 1),
(2, 1),
(3, 1),
(3, 2),
(4, 2),
(4, 3),
(5, 3);

INSERT INTO Книги_Жанры (Книга_ID, Жанр_ID)
VALUES
(1, 3),
(1, 1),
(2, 1),
(2, 2),
(2, 3),
(3, 3),
(3, 2),
(4, 1),
(4, 2),
(5, 2);